# DATE:20/03/2019

### ANOVA - one way analysis of varience

one category and one numerical is called one way,we will check wheather the vaarience or difference
between two or more groups and sample is normally distributed

if more than one categorical column is compare with one numerical column is called two way anova

have one group and u are double-testing that same group
you are testing one set of individuals before and after they take medication to see if it works or not

two groups or more groups, and the members of those groups are doing more than one thing 2 way anova with replication

when null hypothesis rejected then we will go for turky hsd test

hsd:honestly significant difference

# ============================================================

In [1]:
from pydataset import data
import scipy.stats as stats
from statsmodels.stats.multicomp import pairwise_tukeyhsd

In [1]:
import pandas as pd
import numpy as np

In [2]:
#importing inbuild  dataset directly 
df = data('chickwts')
df.head()

   weight       feed
1     179  horsebean
2     160  horsebean
3     136  horsebean
4     227  horsebean
5     217  horsebean

In [12]:
#sample size
df1 = df.groupby("feed").size().reset_index()
df1 = df1.rename(columns={0:"count"})
df1

        feed  count
0     casein     12
1  horsebean     10
2    linseed     12
3   meatmeal     11
4    soybean     14
5  sunflower     12

In [14]:
#average weight of each sample
df2 = df.groupby("feed")["weight"].mean().reset_index()
df2

        feed      weight
0     casein  323.583333
1  horsebean  160.200000
2    linseed  218.750000
3   meatmeal  276.909091
4    soybean  246.428571
5  sunflower  328.916667

In [15]:
# H0 : feed does not effect the weight of the chickens
# H1 : feed does empact the weight of chickens
#Elpha : 0.05

In [19]:
#creating the array of weight for each category

casein = df["weight"][df["feed"]=="casein"]
horsebean = df["weight"][df["feed"]=="horsebean"]
linseed = df["weight"][df["feed"]=="linseed"]
meatmeal = df["weight"][df["feed"]=="meatmeal"]
soybean = df["weight"][df["feed"]=="soybean"]
sunflower = df["weight"][df["feed"]=="sunflower"]

In [20]:
#creating annova model

stats.f_oneway(casein,horsebean,linseed,meatmeal,soybean,sunflower)

F_onewayResult(statistic=15.364799774712534, pvalue=5.936419853471331e-10)

as p value less than 0.05 we will reject null hypothesis and alternative hypo is accepted

now we need to refer the best feed for that we need turkey hsd test

In [23]:
HSD = pairwise_tukeyhsd(df.weight, df.feed, alpha=0.05)
HSD.summary()

from the above experiment caseien and soyabean are the best option to recomend but feeding anything does not mak any diffr

# =============================================================

In [2]:
tyre_data = pd.read_csv("./EDA_DATA/tyre.csv")

student_data = pd.read_excel("./EDA_DATA/Students Marks.xlsx")

### which tyre you supposed to reffer to the customer as best fit for mileage???

In [3]:
tyre_data.head()

   Brands  Mileage
0  Apollo   32.998
1  Apollo   36.435
2  Apollo   32.777
3  Apollo   37.637
4  Apollo   36.304

In [4]:
student_data.head()

   Students Exam  Marks
0  student1   IA     96
1  student1   FA     36
2  student2   IA    100
3  student2   FA     48
4  student3   IA     15

In [24]:
tyre_data.groupby("Brands").size().reset_index()

        Brands   0
0       Apollo  15
1  Bridgestone  15
2         CEAT  15
3       Falken  15

In [25]:
tyre_data2 = tyre_data.groupby("Brands")["Mileage"].mean().reset_index()
tyre_data2

        Brands    Mileage
0       Apollo  34.799133
1  Bridgestone  31.780133
2         CEAT  34.761207
3       Falken  37.624667

In [26]:
# H0 : Brands does not effect the Mileage 
# H1 : Brands does empact the Mileage 
#Elpha : 0.05

In [30]:

Apollo = tyre_data["Mileage"][tyre_data["Brands"]=="Apollo"]
Bridgestone = tyre_data["Mileage"][tyre_data["Brands"]=="Bridgestone"]
CEAT = tyre_data["Mileage"][tyre_data["Brands"]=="CEAT"]
Falken = tyre_data["Mileage"][tyre_data["Brands"]=="Falken"]

In [31]:
#creating annova model

stats.f_oneway(Apollo,Bridgestone,CEAT,Falken)

F_onewayResult(statistic=17.941513342446925, pvalue=2.78098919789432e-08)

as p value less than 0.05 we will reject null hypothesis and alternative hypo is accepted

now we need to refer the best feed for that we need turkey hsd test

In [33]:
HSD1 = pairwise_tukeyhsd(tyre_data.Mileage, tyre_data.Brands, alpha=0.05)
HSD1.summary()

falken tyre will be best tyre for milage purpose

# ============================================================

## TWO way Anova test

In [34]:
student_data.head()

   Students Exam  Marks
0  student1   IA     96
1  student1   FA     36
2  student2   IA    100
3  student2   FA     48
4  student3   IA     15

wheather students has any effect on marks or exam has eny effect on marks

In [35]:
# H0:student or exam type does not impact marks
# H1:student or exam type does impact marks

In [36]:
from statsmodels.stats.anova import AnovaRM

In [37]:
#creating two way anova model
#if two category come in within func we have to add one id column
#AnoveRM(df, numeric_col, Row_identifier, within=[IV1,IV2])


#Student as a row identifier
model = AnovaRM(student_data, "Marks", "Students", within=["Exam"])
fit = model.fit()
fit.summary()

<class 'statsmodels.iolib.summary2.Summary'>
"""
              Anova
=================================
     Num DF Den DF F Value Pr > F
---------------------------------
Exam 1.0000 9.0000  3.8012 0.0830
=================================

"""

### p -Value is greater than significance level--->>accept null

In [38]:
#Exam as a row identifier
model = AnovaRM(student_data, "Marks","Exam" , within=["Students"])
fit = model.fit()
fit.summary()

<class 'statsmodels.iolib.summary2.Summary'>
"""
                Anova
=====================================
         Num DF Den DF F Value Pr > F
-------------------------------------
Students 9.0000 9.0000  1.2216 0.3852
=====================================

"""

### p -Value is greater than significance level--->>accept null.......

In [ ]:
so both the Exam and Student has no impact on Marks

# =============================================================